system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         800;  // Extended simulation time for the 10m domain

deltaT          0.004;  // Smaller initial timestep for stability 

writeControl    adjustableRunTime;

writeInterval   5;  // Adjusted write interval for better sampling in longer domain

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;  // Conservative Courant number for better stability

maxAlphaCo      0.25;  // Conservative alpha Courant number

maxDeltaT       0.2;  // Limited maximum timestep size

functions
{
    // Function object to track the simulation progress
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   25;
        
        probeLocations
        (
            (5.0 1.25 0.005)   // Center of the domain
            (2.5 1.25 0.005)   // Quarter-way through domain
            (7.5 1.25 0.005)   // Three-quarters through domain
        );
        
        fields
        (
            alpha.water
            p
            U
        );
    }
}

// ************************************************************************* //