system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2212
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0  // Initially all domain is filled with oil
);

regions
(
    // Left side water region
    boxToCell
    {
        box (0 0 0) (1.0 2.5 0.01);  // Water occupies first 1m
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    
    // Add perturbations at the interface to promote finger development
    boxToCell
    {
        box (1.0 0.3 0) (1.3 0.9 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.7
        );
    }
    
    boxToCell
    {
        box (1.0 1.1 0) (1.4 1.7 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.8
        );
    }
    
    boxToCell
    {
        box (1.0 1.9 0) (1.3 2.3 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.75
        );
    }
    
    // Add sharper perturbations to create dominant fingers
    boxToCell
    {
        box (1.1 0.6 0) (1.6 0.8 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.9
        );
    }
    
    boxToCell
    {
        box (1.2 1.4 0) (1.7 1.6 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.85
        );
    }
);

// ************************************************************************* //
